# TilePatternGridCellsY Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..TilePatternGridCellsY Property
ParameterTypeId Class See Also
---
"Number of vertical cells"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId TilePatternGridCellsY { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TilePatternGridCellsY As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ TilePatternGridCellsY {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace